solokeys/solo1/targets/stm32l432/src/init.c
// Copyright 2019 SoloKeys Developers
//
// Licensed under the Apache License, Version 2.0, <LICENSE-APACHE or
// http://apache.org/licenses/LICENSE-2.0> or the MIT license <LICENSE-MIT or
// http://opensource.org/licenses/MIT>, at your option. This file may not be
// copied, modified, or distributed except according to those terms.
#include <stdint.h>
#include "stm32l4xx.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_rcc.h"
#include "stm32l4xx_ll_crs.h"
#include "stm32l4xx_ll_system.h"
#include "stm32l4xx_ll_pwr.h"
#include "stm32l4xx_ll_utils.h"
#include "stm32l4xx_ll_cortex.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_usart.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_tim.h"
#include "stm32l4xx_ll_rng.h"
#include "stm32l4xx_ll_spi.h"
#include "stm32l4xx_ll_usb.h"
#include "stm32l4xx_hal_pcd.h"
#include "stm32l4xx_hal.h"

#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_hid.h"
#include "usbd_cdc.h"
#include "usbd_composite.h"
#include "usbd_cdc_if.h"
#include "device.h"
#include "init.h"
#include APP_CONFIG

// KHz
#define MAX_CLOCK_RATE      24000

#define SET_CLOCK_RATE2()        SystemClock_Config()

#if MAX_CLOCK_RATE == 48000
    #define SET_CLOCK_RATE0()        SystemClock_Config_LF32()
    #define SET_CLOCK_RATE1()        SystemClock_Config_LF48()
#elif MAX_CLOCK_RATE == 32000
    #define SET_CLOCK_RATE0()        SystemClock_Config_LF24()
    #define SET_CLOCK_RATE1()        SystemClock_Config_LF32()
#elif MAX_CLOCK_RATE == 28000
    #define SET_CLOCK_RATE0()        SystemClock_Config_LF24()
    #define SET_CLOCK_RATE1()        SystemClock_Config_LF28()
#elif MAX_CLOCK_RATE == 24000
    #define SET_CLOCK_RATE0()        SystemClock_Config_LF16()
    #define SET_CLOCK_RATE1()        SystemClock_Config_LF24()
#elif MAX_CLOCK_RATE == 20000
    #define SET_CLOCK_RATE0()        SystemClock_Config_LF16()
    #define SET_CLOCK_RATE1()        SystemClock_Config_LF20()
#elif MAX_CLOCK_RATE == 16000
    #define SET_CLOCK_RATE0()        SystemClock_Config_LF8()
    #define SET_CLOCK_RATE1()        SystemClock_Config_LF16()
#else
#error "Invalid clock rate selected"
#endif

USBD_HandleTypeDef Solo_USBD_Device;

static void LL_Init(void);

#define Error_Handler() _Error_Handler(__FILE__,__LINE__)
void _Error_Handler(char *file, int line);

void SystemClock_Config(void);
void SystemClock_Config_LF16(void);
void SystemClock_Config_LF20(void);
void SystemClock_Config_LF24(void);
void SystemClock_Config_LF28(void);
void SystemClock_Config_LF48(void);

void hw_init(int lowfreq)
{
#ifdef IS_BOOTLOADER
    SCB->VTOR = FLASH_BASE;
#else
#endif
    LL_Init();
    init_gpio();

    if (lowfreq)
    {
        LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE2); // Under voltage
        device_set_clock_rate(DEVICE_LOW_POWER_IDLE);
        LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE2);
    }
    else
    {
        SystemClock_Config();
    }



    if (!lowfreq)
    {
        init_pwm();
    }

    init_millisecond_timer(lowfreq);

#if DEBUG_LEVEL > 0
    init_debug_uart();
#endif

    init_rng();
    init_spi();

}

static void LL_Init(void)
{
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);

    NVIC_SetPriorityGrouping(4);

    /* System interrupt init*/
    /* MemoryManagement_IRQn interrupt configuration */
    NVIC_SetPriority(MemoryManagement_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
    /* BusFault_IRQn interrupt configuration */
    NVIC_SetPriority(BusFault_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
    /* UsageFault_IRQn interrupt configuration */
    NVIC_SetPriority(UsageFault_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
    /* SVCall_IRQn interrupt configuration */
    NVIC_SetPriority(SVCall_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
    /* DebugMonitor_IRQn interrupt configuration */
    NVIC_SetPriority(DebugMonitor_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
    /* PendSV_IRQn interrupt configuration */
    NVIC_SetPriority(PendSV_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
    /* SysTick_IRQn interrupt configuration */
    NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));

}

void device_set_clock_rate(DEVICE_CLOCK_RATE param)
{
    switch(param)
    {
        case DEVICE_LOW_POWER_IDLE:
            SET_CLOCK_RATE0();
        break;
        case DEVICE_LOW_POWER_FAST:
            SET_CLOCK_RATE1();
        break;
        case DEVICE_FAST:
            SET_CLOCK_RATE2();
        break;
    }
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
    SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_PWREN);

      LL_FLASH_SetLatency(LL_FLASH_LATENCY_2);

       if(LL_FLASH_GetLatency() != LL_FLASH_LATENCY_2)
      {
      Error_Handler();
      }
      LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);

      LL_RCC_HSI48_Enable();

       /* Wait till HSI48 is ready */
      while(LL_RCC_HSI48_IsReady() != 1)
      {

      }

      LL_RCC_LSI_Enable();

       /* Wait till LSI is ready */
      while(LL_RCC_LSI_IsReady() != 1)
      {

      }
      LL_RCC_MSI_Enable();
       /* Wait till MSI is ready */
      while(LL_RCC_MSI_IsReady() != 1)
      {

      }
      LL_RCC_MSI_EnableRangeSelection();

      LL_RCC_MSI_SetRange(LL_RCC_MSIRANGE_11);

      LL_RCC_MSI_SetCalibTrimming(0);

      LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_MSI);

       /* Wait till System clock is ready */
      while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_MSI)
      {

      }
      LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);

      LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_1);

      LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_16);

      LL_Init1msTick(48000000);

      LL_SYSTICK_SetClkSource(LL_SYSTICK_CLKSOURCE_HCLK);

      LL_SetSystemCoreClock(48000000);

      LL_RCC_SetUSARTClockSource(LL_RCC_USART1_CLKSOURCE_PCLK2);

      LL_RCC_SetUSBClockSource(LL_RCC_USB_CLKSOURCE_HSI48);

      LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_CRS);

